backend/app/models/booking.rb

  def generate_confirmation_code
    self.confirmation = loop do
      code = SecureRandom.alphanumeric(7).upcase
      break code unless Booking.exists?(confirmation: code)
---
SELECT 1 AS one FROM "bookings" WHERE "bookings"."confirmation" = 'G0RSQFT' LIMIT 1