backend/app/controllers/api/v1/auth_controller.rb

  def register
    user = User.new(user_params)
    if user.save
---
INSERT INTO "users" ("created_at", "email", "name", "password_digest", "role", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["created_at", "2026-02-04 20:37:21.517005"], ["email", "[FILTERED]"], ["name", "Test User"], ["password_digest", "[FILTERED]"], ["role", "guest"], ["updated_at", "2026-02-04 20:37:21.517005"]]

  def login
    user = User.find_by(email: params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "[FILTERED]"], ["LIMIT", 1]]