backend/app/controllers/api/v1/bookings_controller.rb

  def index
    @bookings = current_user.staff? ? Booking.all : current_user.bookings
    @bookings = @bookings.includes(:user, :room_type, :room)

    # Filter by status
    @bookings = @bookings.where(status: params[:status]) if params[:status].present?
---
SELECT "bookings".* FROM "bookings" WHERE "bookings"."user_id" = $1 AND (guest_name ILIKE $2 OR confirmation ILIKE $3)  [["user_id", 12], [nil, "%John%"], [nil, "%John%"]]
SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2)  [["id", 16], ["id", 17]]
SELECT "bookings".* FROM "bookings" WHERE "bookings"."user_id" = $1 AND "bookings"."status" = $2  [["user_id", 11], ["status", "confirmed"]]

  def create
    @booking = current_user.bookings.new(booking_params)
    if @booking.save
---
INSERT INTO "bookings" ("authorize_card", "check_in", "check_out", "confirmation", "created_at", "guest_count", "guest_name", "price", "room_id", "room_type_id", "status", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"

  def update
    if @booking.update(booking_params)
---
UPDATE "bookings" SET "guest_count" = $1, "updated_at" = $2 WHERE "bookings"."id" = $3  [["guest_count", 3], ["updated_at", "2026-02-04 20:37:23.372361"], ["id", 19]]

  def check_in
    return render json: { errors: ['Staff only'] }, status: :forbidden unless current_user.staff?

    if @booking.update(status: 'Checked In')
---
UPDATE "bookings" SET "status" = $1, "updated_at" = $2 WHERE "bookings"."id" = $3  [["status", "Checked In"], ["updated_at", "2026-02-04 20:37:23.387084"], ["id", 20]]

  def check_out
    return render json: { errors: ['Staff only'] }, status: :forbidden unless current_user.staff?

    if @booking.update(status: 'Departing')
---
UPDATE "bookings" SET "status" = $1, "updated_at" = $2 WHERE "bookings"."id" = $3  [["status", "Departing"], ["updated_at", "2026-02-04 20:37:23.411868"], ["id", 22]]

  def assign_room
    return render json: { errors: ['Staff only'] }, status: :forbidden unless current_user.staff?

    room = Room.find_by(id: params[:room_id])
    if room && @booking.update(room: room)
---
SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]
UPDATE "bookings" SET "room_id" = $1, "updated_at" = $2 WHERE "bookings"."id" = $3  [["room_id", 17], ["updated_at", "2026-02-04 20:37:23.441339"], ["id", 24]]

  def destroy
    @booking.update(status: 'cancelled')
---
UPDATE "bookings" SET "status" = $1, "updated_at" = $2 WHERE "bookings"."id" = $3  [["status", "cancelled"], ["updated_at", "2026-02-04 20:37:23.462002"], ["id", 26]]

  def set_booking
    @booking = current_user.staff? ? Booking.find(params[:id]) : current_user.bookings.find(params[:id])
---
SELECT "bookings".* FROM "bookings" WHERE "bookings"."user_id" = $1 AND "bookings"."id" = $2 LIMIT $3  [["user_id", 35], ["id", 26], ["LIMIT", 1]]