backend/app/controllers/api/v1/rooms_controller.rb

SELECT "rooms".* FROM "rooms" WHERE "rooms"."room_type_id" = $1  [["room_type_id", 32]]
SELECT "rooms".* FROM "rooms" WHERE "rooms"."status" = $1  [["status", "available"]]
---
  def index
    @rooms = Room.includes(:room_type).all

    # Filter by room type
    @rooms = @rooms.by_type(params[:room_type_id]) if params[:room_type_id].present?

    # Filter by status
    @rooms = @rooms.where(status: params[:status]) if params[:status].present?

INSERT INTO "rooms" ("amenities", "bed_type", "created_at", "description", "floor_no", "images", "price_per_night", "room_no", "room_type_id", "size", "status", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"
---
  def create
    @room = Room.new(room_params)
    if @room.save

UPDATE "rooms" SET "status" = $1, "updated_at" = $2 WHERE "rooms"."id" = $3  [["status", "maintenance"], ["updated_at", "2026-02-04 20:37:23.627915"], ["id", 36]]
---
  def update
    if @room.update(room_params)

DELETE FROM "rooms" WHERE "rooms"."id" = $1  [["id", 38]]
---
  def destroy
    @room.destroy

SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = $1 LIMIT $2  [["id", 38], ["LIMIT", 1]]
---
  def set_room
    @room = Room.find(params[:id])