backend/app/controllers/api/v1/room_types_controller.rb

  def index
    @room_types = RoomType.all
---
SELECT "room_types".* FROM "room_types"

  def create
    @room_type = RoomType.new(room_type_params)
    if @room_type.save
---
INSERT INTO "room_types" ("created_at", "description", "image", "max_guests", "name", "price", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    if @room_type.update(room_type_params)
---
UPDATE "room_types" SET "price" = $1, "updated_at" = $2 WHERE "room_types"."id" = $3  [["price", "150.0"], ["updated_at", "2026-02-04 20:37:23.510089"], ["id", 27]]

  def destroy
    @room_type.destroy
---
DELETE FROM "room_types" WHERE "room_types"."id" = $1  [["id", 29]]

  def set_room_type
    @room_type = RoomType.find(params[:id])
---
SELECT "room_types".* FROM "room_types" WHERE "room_types"."id" = $1 LIMIT $2  [["id", 29], ["LIMIT", 1]]